wellrun/hc32f460/hc32f460_sdk/驱动库及样例/hc32f46x_ddl/example/adc/adc_07_sa_sb_dma_interrupt/source/main.c
#define ADC1_SB_DMA_UNIT            M4_DMA1
#define ADC1_SB_DMA_CH              DmaCh1
#define ADC1_SB_DMA_PWC             PWC_FCG0_PERIPH_DMA1
#define ADC1_SB_DMA_TRGSRC          EVT_ADC1_EOCB
#define ADC1_SB_DMA_IRQ_NUM         INT_DMA1_BTC1
#define ADC1_SB_DMA_INT_CB          Dma1Btc1_IrqHandler

/* DMA definition for ADC2. */
#define ADC2_SA_DMA_UNIT            M4_DMA1
#define ADC2_SA_DMA_CH              DmaCh2
#define ADC2_SA_DMA_PWC             PWC_FCG0_PERIPH_DMA1
#define ADC2_SA_DMA_TRGSRC          EVT_ADC2_EOCA
#define ADC2_SA_DMA_IRQ_NUM         INT_DMA1_BTC2
#define ADC2_SA_DMA_INT_CB          Dma1Btc2_IrqHandler

#define ADC2_SB_DMA_UNIT            M4_DMA1
#define ADC2_SB_DMA_CH              DmaCh3
#define ADC2_SB_DMA_PWC             PWC_FCG0_PERIPH_DMA1
#define ADC2_SB_DMA_TRGSRC          EVT_ADC2_EOCB
#define ADC2_SB_DMA_IRQ_NUM         INT_DMA1_BTC3
#define ADC2_SB_DMA_INT_CB          Dma1Btc3_IrqHandler

/* ADC interrupt flag bit mask definition. */
#define ADC1_SA_DMA_IRQ_BIT         (1ul << 0u)
#define ADC1_SB_DMA_IRQ_BIT         (1ul << 1u)
#define ADC2_SA_DMA_IRQ_BIT         (1ul << 2u)
#define ADC2_SB_DMA_IRQ_BIT         (1ul << 3u)

/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/
static void AdcConfig(void);
static void AdcClockConfig(void);
static void AdcInitConfig(void);
static void AdcChannelConfig(void);
static void AdcTriggerConfig(void);

static void DmaConfig(void);
static void DmaInitConfig(void);
static void DmaIrqConfig(void);
static void DmaIrqRegister(stc_irq_regi_conf_t *pstcCfg, uint32_t u32Priority);

static void TimerConfig(void);

static void AdcSetChannelPinMode(M4_ADC_TypeDef *ADCx,
                                 uint32_t u32Channel,
                                 en_pin_mode_t enMode);
static void AdcSetPinMode(uint8_t u8AdcPin, en_pin_mode_t enMode);

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/
static uint16_t m_au16Adc1SaValue[ADC1_CH_COUNT];
static uint16_t m_au16Adc1SbValue[ADC1_CH_COUNT];
static uint16_t m_au16Adc2SaValue[ADC2_CH_COUNT];
static uint16_t m_au16Adc2SbValue[ADC2_CH_COUNT];

static uint32_t m_u32AdcDmaIrqFlag = 0u;

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/
/**
 *******************************************************************************
 ** \brief  Main function
 **
 ** \param  None
 **
 ** \retval int32_t return value, if needed
 **
 ******************************************************************************/
int32_t main(void)
{
    /* Default clock is MRC(8MHz). */

    /* Config ADCs. */
    AdcConfig();

    /* Config DMA. */
    DmaConfig();

    /* Config UART for printing. Baud rate 115200. */
    Ddl_UartInit();

    /*
     * Config timer0.
     * Timer0 generates event EVT_TMR02_GCMA every second.
     * This event will trigger ADC sequence A to start conversion.
     */
    TimerConfig();

    /***************** Configuration end, application start **************/

    while (1u)
    {
        /* Check ADC1 SA. */
        if (m_u32AdcDmaIrqFlag & ADC1_SA_DMA_IRQ_BIT)
        {
            m_u32AdcDmaIrqFlag &= ~ADC1_SA_DMA_IRQ_BIT;
            printf("\nADC1 SA DMA interrupt.");
            // Do something with m_au16Adc1SaValue.
        }

        /* Check ADC1 SB. */
        if (m_u32AdcDmaIrqFlag & ADC1_SB_DMA_IRQ_BIT)
        {
            m_u32AdcDmaIrqFlag &= ~ADC1_SB_DMA_IRQ_BIT;
            printf("\nADC1 SB DMA interrupt.");
            // Do something with m_au16Adc1SbValue.
        }

        /* Check ADC2 SA. */
        if (m_u32AdcDmaIrqFlag & ADC2_SA_DMA_IRQ_BIT)
        {
            m_u32AdcDmaIrqFlag &= ~ADC2_SA_DMA_IRQ_BIT;
            printf("\nADC2 SA DMA interrupt.");
            // Do something with m_au16Adc2SaValue.
        }

        /* Check ADC2 SB. */
        if (m_u32AdcDmaIrqFlag & ADC2_SB_DMA_IRQ_BIT)
        {
            m_u32AdcDmaIrqFlag &= ~ADC2_SB_DMA_IRQ_BIT;
            printf("\nADC2 SB DMA interrupt.");
            // Do something with m_au16Adc2SbValue.
        }
    }
}

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/
/**
 *******************************************************************************
 ** \brief  ADC configuration, including clock configuration, initial configuration,
 **         channel configuration and trigger source configuration.
 **
 ** \param  None.
 **
 ** \retval None.
 **
 ******************************************************************************/
static void AdcConfig(void)
{
    AdcClockConfig();
    AdcInitConfig();
    AdcChannelConfig();
    AdcTriggerConfig();
}

/**
 *******************************************************************************
 ** \brief  ADC clock configuration.
 **
 ** \note   1) ADCLK max frequency is 60MHz.
 **         2) If PCLK2 and PCLK4 are selected as the ADC clock,
 **            the following conditions must be met:
 **            a. ADCLK(PCLK2) max 60MHz;
 **            b. PCLK4 : ADCLK = 1:1, 2:1, 4:1, 8:1, 1:2, 1:4
 **
 ******************************************************************************/
static void AdcClockConfig(void)
{
#if (ADC_CLK == ADC_CLK_PCLK)
    stc_clk_sysclk_cfg_t stcSysclkCfg;

    /* Set bus clock division, depends on the system clock frequency. */
    stcSysclkCfg.enHclkDiv  = ClkSysclkDiv1;  // Max 168MHz
    stcSysclkCfg.enExclkDiv = ClkSysclkDiv2;  // Max 84MHz
    stcSysclkCfg.enPclk0Div = ClkSysclkDiv1;  // Max 168MHz
    stcSysclkCfg.enPclk1Div = ClkSysclkDiv2;  // Max 84MHz
    stcSysclkCfg.enPclk2Div = ClkSysclkDiv4;  // Max 60MHz
    stcSysclkCfg.enPclk3Div = ClkSysclkDiv4;  // Max 42MHz
    stcSysclkCfg.enPclk4Div = ClkSysclkDiv1;  // Max 84MHz.
    CLK_SysClkConfig(&stcSysclkCfg);
    CLK_SetPeriClkSource(ClkPeriSrcPclk);

#elif (ADC_CLK == ADC_CLK_MPLLQ)
    stc_clk_xtal_cfg_t stcXtalCfg;
    stc_clk_mpll_cfg_t stcMpllCfg;

