wellrun/hc32f460/hc32f460_sdk/驱动库及样例/hc32f46x_ddl/example/adc/adc_07_sa_sb_dma_interrupt/source/main.c
    stcDmaCfg.u16BlockSize   = ADC1_CH_COUNT;
    stcDmaCfg.u16TransferCnt = 0u;
    stcDmaCfg.u32SrcAddr     = (uint32_t)(&M4_ADC1->DR0);
    stcDmaCfg.u32DesAddr     = (uint32_t)(&m_au16Adc1SaValue[0]);
    stcDmaCfg.u16DesRptSize  = ADC1_CH_COUNT;
    stcDmaCfg.u16SrcRptSize  = ADC1_CH_COUNT;
    stcDmaCfg.u32DmaLlp      = 0u;
    stcDmaCfg.stcSrcNseqCfg.u16Cnt    = 0;
    stcDmaCfg.stcSrcNseqCfg.u32Offset = 0;
    stcDmaCfg.stcDesNseqCfg.u16Cnt    = 0;
    stcDmaCfg.stcDesNseqCfg.u32Offset = 0;
    stcDmaCfg.stcDmaChCfg.enSrcInc    = AddressIncrease;
    stcDmaCfg.stcDmaChCfg.enDesInc    = AddressIncrease;
    stcDmaCfg.stcDmaChCfg.enSrcRptEn  = Enable;
    stcDmaCfg.stcDmaChCfg.enDesRptEn  = Enable;
    stcDmaCfg.stcDmaChCfg.enSrcNseqEn = Disable;
    stcDmaCfg.stcDmaChCfg.enDesNseqEn = Disable;
    stcDmaCfg.stcDmaChCfg.enTrnWidth  = Dma16Bit;
    stcDmaCfg.stcDmaChCfg.enLlpEn     = Disable;
    /* Enable DMA interrupt. */
    stcDmaCfg.stcDmaChCfg.enIntEn     = Enable;

    PWC_Fcg0PeriphClockCmd(ADC1_SA_DMA_PWC, Enable);
    DMA_InitChannel(ADC1_SA_DMA_UNIT, ADC1_SA_DMA_CH, &stcDmaCfg);
    DMA_Cmd(ADC1_SA_DMA_UNIT, Enable);
    DMA_ChannelCmd(ADC1_SA_DMA_UNIT, ADC1_SA_DMA_CH, Enable);
    DMA_ClearIrqFlag(ADC1_SA_DMA_UNIT, ADC1_SA_DMA_CH, TrnCpltIrq);
    /* AOS must be enabled to use DMA */
    /* AOS enabled at first. */
    /* If you have enabled AOS before, then the following statement is not needed. */
    ENABLE_AOS();
    DMA_SetTriggerSrc(ADC1_SA_DMA_UNIT, ADC1_SA_DMA_CH, ADC1_SA_DMA_TRGSRC);

    stcDmaCfg.u32DesAddr = (uint32_t)(&m_au16Adc1SbValue[0]);
    PWC_Fcg0PeriphClockCmd(ADC1_SB_DMA_PWC, Enable);
    DMA_InitChannel(ADC1_SB_DMA_UNIT, ADC1_SB_DMA_CH, &stcDmaCfg);
    DMA_Cmd(ADC1_SB_DMA_UNIT, Enable);
    DMA_ChannelCmd(ADC1_SB_DMA_UNIT, ADC1_SB_DMA_CH, Enable);
    DMA_ClearIrqFlag(ADC1_SB_DMA_UNIT, ADC1_SB_DMA_CH, TrnCpltIrq);
    DMA_SetTriggerSrc(ADC1_SB_DMA_UNIT, ADC1_SB_DMA_CH, ADC1_SB_DMA_TRGSRC);

    stcDmaCfg.u16BlockSize  = ADC2_CH_COUNT;
    stcDmaCfg.u32SrcAddr    = (uint32_t)(&M4_ADC2->DR0);
    stcDmaCfg.u32DesAddr    = (uint32_t)(&m_au16Adc2SaValue[0]);
    stcDmaCfg.u16DesRptSize = ADC2_CH_COUNT;
    stcDmaCfg.u16SrcRptSize = ADC2_CH_COUNT;
    PWC_Fcg0PeriphClockCmd(ADC2_SA_DMA_PWC, Enable);
    DMA_InitChannel(ADC2_SA_DMA_UNIT, ADC2_SA_DMA_CH, &stcDmaCfg);
    DMA_Cmd(ADC2_SA_DMA_UNIT, Enable);
    DMA_ChannelCmd(ADC2_SA_DMA_UNIT, ADC2_SA_DMA_CH, Enable);
    DMA_ClearIrqFlag(ADC2_SA_DMA_UNIT, ADC2_SA_DMA_CH, TrnCpltIrq);
    DMA_SetTriggerSrc(ADC2_SA_DMA_UNIT, ADC2_SA_DMA_CH, ADC2_SA_DMA_TRGSRC);

    stcDmaCfg.u32DesAddr = (uint32_t)(&m_au16Adc2SbValue[0]);
    PWC_Fcg0PeriphClockCmd(ADC2_SB_DMA_PWC, Enable);
    DMA_InitChannel(ADC2_SB_DMA_UNIT, ADC2_SB_DMA_CH, &stcDmaCfg);
    DMA_Cmd(ADC2_SB_DMA_UNIT, Enable);
    DMA_ChannelCmd(ADC2_SB_DMA_UNIT, ADC2_SB_DMA_CH, Enable);
    DMA_ClearIrqFlag(ADC2_SB_DMA_UNIT, ADC2_SB_DMA_CH, TrnCpltIrq);
    DMA_SetTriggerSrc(ADC2_SB_DMA_UNIT, ADC2_SB_DMA_CH, ADC2_SB_DMA_TRGSRC);
}

/**
 *******************************************************************************
 ** \brief  DMA interrupt configuration.
 **
 ** \note   DMA NVIC number: [Int000_IRQn, Int031_IRQn]
 **                          [Int038_IRQn, Int043_IRQn]
 **                          [Int129_IRQn]
 **
 ******************************************************************************/
static void DmaIrqConfig(void)
{
    stc_irq_regi_conf_t stcAdcIrqCfg;

    stcAdcIrqCfg.enIntSrc    = ADC1_SA_DMA_IRQ_NUM;
    stcAdcIrqCfg.enIRQn      = Int030_IRQn;
    stcAdcIrqCfg.pfnCallback = ADC1_SA_DMA_INT_CB;
    DmaIrqRegister(&stcAdcIrqCfg, DDL_IRQ_PRIORITY_03);

    stcAdcIrqCfg.enIntSrc    = ADC1_SB_DMA_IRQ_NUM;
    stcAdcIrqCfg.enIRQn      = Int031_IRQn;
    stcAdcIrqCfg.pfnCallback = ADC1_SB_DMA_INT_CB;
    DmaIrqRegister(&stcAdcIrqCfg, DDL_IRQ_PRIORITY_04);

    stcAdcIrqCfg.enIntSrc    = ADC2_SA_DMA_IRQ_NUM;
    stcAdcIrqCfg.enIRQn      = Int040_IRQn;
    stcAdcIrqCfg.pfnCallback = ADC2_SA_DMA_INT_CB;
    DmaIrqRegister(&stcAdcIrqCfg, DDL_IRQ_PRIORITY_06);

    stcAdcIrqCfg.enIntSrc    = ADC2_SB_DMA_IRQ_NUM;
    stcAdcIrqCfg.enIRQn      = Int129_IRQn;
    stcAdcIrqCfg.pfnCallback = ADC2_SB_DMA_INT_CB;
    DmaIrqRegister(&stcAdcIrqCfg, DDL_IRQ_PRIORITY_05);
}

/**
 *******************************************************************************
 ** \brief  DMA IRQ register function.
 **
 ******************************************************************************/
static void DmaIrqRegister(stc_irq_regi_conf_t *pstcCfg, uint32_t u32Priority)
{
    int16_t s16Vnum = pstcCfg->enIRQn;

    if (((s16Vnum >= Int000_IRQn) && (s16Vnum <= Int031_IRQn)) ||
        ((s16Vnum >= Int038_IRQn) && (s16Vnum <= Int043_IRQn)))
    {
        if (Ok != enIrqRegistration(pstcCfg))
        {
            return;
        }
    }
    else if (Int129_IRQn == s16Vnum)
    {
        enShareIrqEnable(pstcCfg->enIntSrc);
    }
    else
    {
        return;
    }
    NVIC_ClearPendingIRQ(pstcCfg->enIRQn);
    NVIC_SetPriority(pstcCfg->enIRQn, u32Priority);
    NVIC_EnableIRQ(pstcCfg->enIRQn);
}

/**
 *******************************************************************************
 ** \brief  Timer configuration, for generating event EVT_TMR02_GCMA every second.
 **
 ** \param  None.
 **
 ** \retval None.
 **
 ******************************************************************************/
static void TimerConfig(void)
{
    stc_tim0_base_init_t stcTimerCfg;
    stc_clk_freq_t stcClkTmp;
    uint32_t u32Pclk1;

    MEM_ZERO_STRUCT(stcTimerCfg);
    /* Get PCLK1. */
    CLK_GetClockFreq(&stcClkTmp);
    u32Pclk1 = stcClkTmp.pclk1Freq;

    /* Timer0 peripheral enable. */
    ENABLE_TMR0();
    /* Config register for channel A. */
    stcTimerCfg.Tim0_CounterMode = Tim0_Sync;
    stcTimerCfg.Tim0_SyncClockSource = Tim0_Pclk1;
    stcTimerCfg.Tim0_ClockDivision = Tim0_ClkDiv1024;
    /* Tim0_CmpValue's type is uint16_t!!! Be careful!!! */
    stcTimerCfg.Tim0_CmpValue = u32Pclk1 / 1024 - 1;
    TIMER0_BaseInit(TMR_UNIT, Tim0_ChannelA, &stcTimerCfg);

